app/views/admin/cds/_form.html.erb


      <%= f.collection_select :artist_id, Artist.all.order("name"), :id, :name, :class =>"string", :include_blank => true, label: "アーティスト名" %>
---
SELECT "artists".* FROM "artists" ORDER BY name