app/views/admin/cds/index.html.erb

            <td>
                <%= cd.artist.name if cd.artist_id.present? %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]