app/views/cds/show.html.erb

SELECT "discs".* FROM "discs" WHERE "discs"."cd_id" = ?  [["cd_id", 2]]
---
        <th>
          <% @cd.discs.each do |disc| %>

SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ?  [["disc_id", 2]]
---
                <th>
                  <% disc.songs.each do |song| %>