app/controllers/admin/artists_controller.rb

INSERT INTO "artists" ("name", "image_id", "label", "hp", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    artist = Artist.new(artist_params)
    artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "image_id" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["image_id", "e1d494fc0cb82a806ffdacd41a5e54d1b5cb76f8f2f6468463a9d556055b"], ["updated_at", "2018-07-11 10:31:28.020227"], ["id", 1]]
---
  def update
    artist = Artist.find(params[:id])
    # binding.pry
    artist.update(artist_params)