app/views/boughts/index.html.erb

SELECT "boughtitems".* FROM "boughtitems" WHERE "boughtitems"."bought_id" = ?  [["bought_id", 23]]
---
                	<div>
                	  <% b.boughtitems.each do |item| %>