app/views/carts/show.html.erb

SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ?  [["cart_id", 18]]
---

      <% @cart.cartitems.each do |item| %>