app/controllers/carts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
      @bought = Bought.new
      @user = User.find_by(id: current_user.id)
      if @user.ships.present?

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create

      @bought = Bought.new(bought_params)
      @bought.user_id = current_user.id

      @cart = current_cart
      @cart.user_id = current_user.id

      @user = User.find_by(id: current_user.id)

SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ?  [["cart_id", 56]]
---
      end
       if @bought.save

           @cart.cartitems.each do |item|