app/controllers/carts_controller.rb

INSERT INTO "boughts" ("user_id", "name", "post", "address", "tel", "kana", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["name", ""], ["post", ""], ["address", ""], ["tel", ""], ["kana", ""], ["created_at", "2018-07-18 10:55:06.429583"], ["updated_at", "2018-07-18 10:55:06.429583"]]
INSERT INTO "boughts" ("user_id", "name", "post", "address", "tel", "kana", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "ships" ("name", "post", "address", "tel", "kana", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "carts".* FROM "carts" WHERE "carts"."cart_id" = ? LIMIT ?  [["cart_id", 16], ["LIMIT", 1]]
SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ?  [["cart_id", 54]]
---
  def create

      @bought = Bought.new(bought_params)
      @bought.user_id = current_user.id

      @cart = current_cart
      @cart.user_id = current_user.id
      #binding.pry

      if @bought.save
       # binding.pry
         @ship = Ship.new
         @ship.user_id = current_user.id
         @ship.name = @bought.name
         @ship.kana = @bought.kana
         @ship.post = @bought.post
         @ship.address = @bought.address
         @ship.tel = @bought.tel
         @ship.save

         @cart.cartitems.each do |item|

UPDATE "artists" SET "proceed" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["proceed", 55], ["updated_at", "2018-07-20 09:24:20.752677"], ["id", 2]]
INSERT INTO "boughtitems" ("cd_id", "quantity", "subtotal", "bought_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cd_id", 5], ["quantity", 1], ["subtotal", 1000], ["bought_id", 60], ["created_at", "2018-07-20 09:24:20.803618"], ["updated_at", "2018-07-20 09:24:20.803618"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 54]]
---

            @artist = @cd.artist
            @artist.proceed += @cd.proceed
            @artist.save

            @boughtitem.save
        end
         #binding.pry
         Cart.destroy(session[:cart_id])