app/controllers/cartitems_controller.rb

SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ? AND "cartitems"."cd_id" = ? LIMIT ?  [["cart_id", 5], ["cd_id", 2], ["LIMIT", 1]]
SELECT "carts".* FROM "carts"
---
  def create
      @cart = current_cart
      #cd = Cd.find(params[:cd_id])
      @cartitem = Cartitem.find_by(cart_id: params[:cart_id], id: params[:id])
      @cartitem = @cart.cartitems.find_by(cd_id: params[:cd_id])
      if @cartitem.blank?

SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def set_cartitem
        @cartitem = Cartitem.find(params[:id])