app/controllers/cartitems_controller.rb

INSERT INTO "cartitems" ("cd_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cd_id", 2], ["cart_id", 18], ["created_at", "2018-07-18 04:47:45.550354"], ["updated_at", "2018-07-18 04:47:45.550354"]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2018-07-18 10:36:28.744291"], ["updated_at", "2018-07-18 10:36:28.744291"]]
UPDATE "cartitems" SET "quantity" = ?, "updated_at" = ? WHERE "cartitems"."id" = ?  [["quantity", 4], ["updated_at", "2018-07-18 04:40:50.313947"], ["id", 5]]
---
  def create

	    @cart = current_cart
	    cd = Cd.find(params[:cd_id])
	    @cartitem = @cart.add_cd(cd.id)

      if @cartitem.save

SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ? AND "cartitems"."id" = ? LIMIT ?  [["cart_id", 47], ["id", 47], ["LIMIT", 1]]
UPDATE "cartitems" SET "quantity" = ?, "updated_at" = ? WHERE "cartitems"."id" = ?  [["quantity", 3], ["updated_at", "2018-07-18 04:47:24.860636"], ["id", 5]]
---
  def update
      @cartitem = Cartitem.find_by(cart_id: params[:id])

      if @cartitem.update(cartitem_params)

DELETE FROM "cartitems" WHERE "cartitems"."id" = ?  [["id", 5]]
---
  def destroy
      @cartitem.destroy

SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_cartitem
        @cartitem = Cartitem.find(params[:id])