app/controllers/requests_controller.rb

INSERT INTO "requests" ("artist_name", "song_name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist_name", "aaaa"], ["song_name", "aaaaaa"], ["url", "aaaaaa"], ["created_at", "2018-07-11 11:15:27.665454"], ["updated_at", "2018-07-11 11:15:27.665454"]]
---
	def create
		request = Request.new(request_params)
		request.user_id =current_user.id
		request.save