app/controllers/roots_controller.rb

SELECT  "artists".* FROM "artists" ORDER BY proceed DESC LIMIT ?  [["LIMIT", 3]]
---
  def top
  	  if user_signed_in?
	  	  if current_user.admin?
	  	  	 redirect_to admin_path, notice: '管理者ログイン完了'
	  	  end
	  end
  	  @artists = Artist.order("proceed DESC").limit(3)