app/controllers/ships_controller.rb

SELECT "ships".* FROM "ships"
---
  def index
  	  @ships = Ship.all